-- MySQL dump 10.13  Distrib 8.0.11, for Win64 (x86_64)
--
-- Host: localhost    Database: thoi_trang
-- ------------------------------------------------------
-- Server version	8.0.11

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `bills`
--

DROP TABLE IF EXISTS `bills`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `bills` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `id_customer` int(11) unsigned NOT NULL,
  `id_last_user_action` int(10) unsigned DEFAULT NULL,
  `date_order` date DEFAULT NULL,
  `total` float DEFAULT NULL COMMENT 'tổng tiền',
  `payment` varchar(200) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL COMMENT 'hình thức thanh toán',
  `note` varchar(500) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `status` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL COMMENT 'trạng thái',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `id_customer` (`id_customer`),
  CONSTRAINT `bills_ibfk_1` FOREIGN KEY (`id_customer`) REFERENCES `customer` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=157 DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bills`
--

LOCK TABLES `bills` WRITE;
/*!40000 ALTER TABLE `bills` DISABLE KEYS */;
INSERT INTO `bills` VALUES (34,37,2,'2020-08-24',14300000,'COD','Ghi Chú','đã xử lý','2020-08-24 15:55:50','2020-08-24 08:55:50'),(35,38,2,'2020-08-24',55000000,'COD','Ghi Chú','đã xử lý','2020-08-24 15:55:52','2020-08-24 08:55:52'),(36,39,2,'2020-08-24',7500000,'COD','Ghi Chú','đã xử lý','2020-08-24 16:12:37','2020-08-24 09:12:37'),(37,40,2,'2020-08-24',11500000,'COD','Ghi Chú','đã xử lý','2020-08-24 16:13:35','2020-08-24 09:13:35'),(38,41,2,'2020-08-24',6800000,'COD','Ghi Chú','đã xử lý','2020-08-24 16:19:18','2020-08-24 09:19:18'),(39,42,2,'2020-08-24',11500000,'COD','Ghi Chú','đã xử lý','2020-08-24 16:31:40','2020-08-24 09:31:40'),(40,43,2,'2020-08-24',11500000,'COD','Ghi Chú','đã xử lý','2020-08-24 16:43:47','2020-08-24 09:43:47'),(41,44,2,'2020-08-24',7000000,'COD','Ghi Chú','đã hủy','2020-08-24 16:51:27','2020-08-24 09:51:27'),(42,45,2,'2020-08-24',7500000,'COD','Ghi Chú','đã hủy','2020-08-24 16:52:21','2020-08-24 09:52:21'),(43,46,1,'2020-08-24',11500000,'COD','Ghi Chú','đã xử lý','2020-08-24 17:31:58','2020-08-24 10:31:58'),(44,47,1,'2020-08-24',11500000,'COD','Ghi Chú','đã hủy','2020-08-24 17:35:22','2020-08-24 10:35:22'),(45,48,1,'2020-08-24',11500000,'ATM','Ghi Chú','đã hủy','2020-08-24 17:49:03','2020-08-24 10:49:03'),(46,49,1,'2020-08-24',4500000,'COD','Ghi Chú','đã hủy','2020-08-24 18:22:16','2020-08-24 11:22:16'),(47,50,5,'2020-08-24',29900000,'COD','Ghi Chú','đã xử lý','2020-08-24 18:20:14','2020-08-24 11:20:14'),(48,51,5,'2020-08-24',375000000,'ATM','Ghi Chú','đã xử lý','2020-08-24 18:16:57','2020-08-24 11:16:57'),(49,52,5,'2020-08-24',89000000,'COD','Ghi Chú','đã xử lý','2020-08-24 18:22:56','2020-08-24 11:22:56'),(50,54,5,'2020-08-24',19000000,'COD','Ghi Chú','đã xử lý','2020-08-24 18:25:10','2020-08-24 11:25:10'),(51,55,2,'2020-08-24',35000000,'COD','Ghi Chú','đã xử lý','2020-08-24 21:26:30','2020-08-24 14:26:30'),(52,56,2,'2020-08-24',55000000,'COD','Ghi Chú','đã xử lý','2020-08-24 21:43:58','2020-08-24 14:43:58'),(53,57,2,'2020-08-24',19000000,'COD','Ghi Chú','đã xử lý','2020-08-24 22:42:02','2020-08-24 15:42:02'),(54,58,2,'2020-08-24',89000000,'COD','Ghi Chú','đã xử lý','2020-08-24 22:43:22','2020-08-24 15:43:22'),(55,59,2,'2020-08-24',6800000,'COD','Ghi Chú','đã xử lý','2020-08-24 22:43:51','2020-08-24 15:43:51'),(56,61,2,'2020-08-24',6800000,'COD','Ghi Chú','đã xử lý','2020-08-25 16:35:13','2020-08-25 09:35:13'),(57,62,5,'2020-08-24',11500000,'COD','Ghi Chú','đã xử lý','2020-08-27 13:16:47','2020-08-27 06:16:47'),(58,63,2,'2020-08-24',14300000,'COD','Ghi Chú','đã xác nhận','2020-08-24 22:29:02','2020-08-24 15:29:02'),(59,64,2,'2020-08-24',11500000,'COD','Ghi Chú','đã xác nhận','2020-08-24 22:32:21','2020-08-24 15:32:21'),(60,66,2,'2020-08-24',19000000,'COD','Ghi Chú','đã xác nhận','2020-08-24 22:33:31','2020-08-24 15:33:31'),(61,68,2,'2020-08-24',18500000,'COD','Ghi Chú','đã xác nhận','2020-08-25 15:54:46','2020-08-25 08:54:46'),(62,69,2,'2020-08-25',17500000,'COD','Ghi Chú','đã xác nhận','2020-08-25 16:34:45','2020-08-25 09:34:45'),(63,70,2,'2020-08-25',17500000,'COD','Ghi Chú','đã xác nhận','2020-08-25 16:35:06','2020-08-25 09:35:06'),(64,71,2,'2020-08-25',17500000,'COD','Ghi Chú','đã xác nhận','2020-08-25 18:49:28','2020-08-25 11:49:28'),(65,72,1,'2020-08-25',17500000,'COD','Ghi Chú','đã hủy','2020-08-27 11:16:36','2020-08-27 04:16:36'),(66,74,1,'2020-08-25',7000000,'COD','Ghi Chú','đã hủy','2020-08-27 12:12:04','2020-08-27 05:12:04'),(67,75,1,'2020-08-25',19000000,'COD','Ghi Chú','đã hủy','2020-08-27 12:13:17','2020-08-27 05:13:17'),(68,76,2,'2020-08-25',55000000,'COD','Ghi Chú','đã xử lý','2020-08-27 12:14:51','2020-08-27 05:14:51'),(69,77,2,'2020-08-25',7000000,'COD','Ghi Chú','đã xác nhận','2020-08-27 12:14:24','2020-08-27 05:14:24'),(70,78,1,'2020-08-25',7000000,'COD','Ghi Chú','đã hủy','2020-08-27 12:15:16','2020-08-27 05:15:16'),(71,79,1,'2020-08-25',6000000,'COD','Ghi Chú','đã hủy','2020-08-27 12:17:30','2020-08-27 05:17:30'),(72,80,1,'2020-08-25',23500000,'COD','Ghi Chú','đã hủy','2020-08-27 12:20:01','2020-08-27 05:20:01'),(73,81,1,'2020-08-25',10000000,'COD','Ghi Chú','đã hủy','2020-08-27 12:25:01','2020-08-27 05:25:01'),(74,82,1,'2020-08-25',7500000,'COD','Ghi Chú','đã hủy','2020-08-27 12:27:28','2020-08-27 05:27:28'),(75,83,1,'2020-08-25',55000000,'COD','Ghi Chú','đã hủy','2020-08-27 12:34:06','2020-08-27 05:34:06'),(76,84,1,'2020-08-25',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-25 08:52:44','2020-08-25 08:52:44'),(77,85,2,'2020-08-25',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-25 08:54:21','2020-08-25 08:54:21'),(78,86,2,'2020-08-25',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-25 08:58:20','2020-08-25 08:58:20'),(79,87,2,'2020-08-25',7500000,'COD','Ghi Chú','Đang xử lý','2020-08-25 09:00:25','2020-08-25 09:00:25'),(80,88,2,'2020-08-25',7500000,'COD','Ghi Chú','Đang xử lý','2020-08-25 09:05:22','2020-08-25 09:05:22'),(81,89,2,'2020-08-25',6500000,'COD','Ghi Chú','Đang xử lý','2020-08-25 09:07:03','2020-08-25 09:07:03'),(82,90,2,'2020-08-25',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-25 09:27:22','2020-08-25 09:27:22'),(83,91,2,'2020-08-25',23500000,'COD','Ghi Chú','Đang xử lý','2020-08-25 09:29:24','2020-08-25 09:29:24'),(84,92,2,'2020-08-25',125000000,'COD','Ghi Chú','Đang xử lý','2020-08-25 09:32:11','2020-08-25 09:32:11'),(85,93,2,'2020-08-25',7500000,'COD','Ghi Chú','Đang xử lý','2020-08-25 09:33:52','2020-08-25 09:33:52'),(86,94,2,'2020-08-25',89000000,'COD','Ghi Chú','Đang xử lý','2020-08-25 09:39:37','2020-08-25 09:39:37'),(87,95,2,'2020-08-25',125000000,'COD','Ghi Chú','Đang xử lý','2020-08-25 09:54:30','2020-08-25 09:54:30'),(88,96,2,'2020-08-25',125000000,'COD','Ghi Chú','Đang xử lý','2020-08-25 09:56:17','2020-08-25 09:56:17'),(89,97,2,'2020-08-25',125000000,'COD','Ghi Chú','Đang xử lý','2020-08-25 09:59:20','2020-08-25 09:59:20'),(90,98,2,'2020-08-25',125000000,'COD','Ghi Chú','Đang xử lý','2020-08-25 10:00:02','2020-08-25 10:00:02'),(91,99,2,'2020-08-25',125000000,'COD','Ghi Chú','Đang xử lý','2020-08-25 10:00:43','2020-08-25 10:00:43'),(92,100,2,'2020-08-25',125000000,'COD','Ghi Chú','Đang xử lý','2020-08-25 10:01:16','2020-08-25 10:01:16'),(93,101,2,'2020-08-25',125000000,'COD','Ghi Chú','Đang xử lý','2020-08-25 10:01:54','2020-08-25 10:01:54'),(94,102,2,'2020-08-25',7500000,'COD','Ghi Chú','Đang xử lý','2020-08-25 10:11:36','2020-08-25 10:11:36'),(95,104,NULL,'2020-08-25',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-25 11:47:48','2020-08-25 11:47:48'),(96,105,2,'2020-08-25',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-25 11:48:49','2020-08-25 11:48:49'),(97,106,2,'2020-08-25',4500000,'COD','Ghi Chú','Đang xử lý','2020-08-25 11:52:46','2020-08-25 11:52:46'),(98,107,2,'2020-08-25',29500000,'COD','Ghi Chú','Đang xử lý','2020-08-25 12:00:24','2020-08-25 12:00:24'),(99,108,2,'2020-08-25',18500000,'COD','Ghi Chú','Đang xử lý','2020-08-25 12:36:57','2020-08-25 12:36:57'),(100,109,1,'2020-08-27',11500000,'COD','Ghi Chú','Đang xử lý','2020-08-26 18:37:29','2020-08-26 18:37:29'),(101,110,1,'2020-08-27',18500000,'COD','Ghi Chú','Đang xử lý','2020-08-26 18:41:03','2020-08-26 18:41:03'),(102,111,1,'2020-08-27',18500000,'COD','Ghi Chú','Đang xử lý','2020-08-26 18:43:11','2020-08-26 18:43:11'),(103,112,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 18:47:27','2020-08-26 18:47:27'),(104,113,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 18:48:13','2020-08-26 18:48:13'),(105,114,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 18:48:19','2020-08-26 18:48:19'),(106,115,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 18:48:45','2020-08-26 18:48:45'),(107,116,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 18:49:03','2020-08-26 18:49:03'),(108,117,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 18:49:22','2020-08-26 18:49:22'),(109,118,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 18:49:35','2020-08-26 18:49:35'),(110,119,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 18:57:38','2020-08-26 18:57:38'),(111,120,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 18:58:18','2020-08-26 18:58:18'),(112,121,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 18:59:32','2020-08-26 18:59:32'),(113,122,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 18:59:36','2020-08-26 18:59:36'),(114,123,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 19:02:21','2020-08-26 19:02:21'),(115,124,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 19:03:09','2020-08-26 19:03:09'),(116,125,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 19:04:38','2020-08-26 19:04:38'),(117,126,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 19:05:01','2020-08-26 19:05:01'),(118,127,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 19:05:42','2020-08-26 19:05:42'),(119,128,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 19:06:33','2020-08-26 19:06:33'),(120,129,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 19:07:17','2020-08-26 19:07:17'),(121,130,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 19:07:38','2020-08-26 19:07:38'),(122,131,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 19:08:08','2020-08-26 19:08:08'),(123,132,1,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-26 19:08:51','2020-08-26 19:08:51'),(124,133,1,'2020-08-27',11500000,'COD','Ghi Chú','Đang xử lý','2020-08-26 19:09:57','2020-08-26 19:09:57'),(125,134,1,'2020-08-27',42500000,'COD','Ghi Chú','Đang xử lý','2020-08-26 19:10:22','2020-08-26 19:10:22'),(126,135,1,'2020-08-27',42500000,'COD','Ghi Chú','Đang xử lý','2020-08-26 19:11:41','2020-08-26 19:11:41'),(127,136,1,'2020-08-27',18500000,'COD','Ghi Chú','Đang xử lý','2020-08-27 03:32:30','2020-08-27 03:32:30'),(128,137,1,'2020-08-27',39000000,'COD','Ghi Chú','Đang xử lý','2020-08-27 04:19:25','2020-08-27 04:19:25'),(129,138,1,'2020-08-27',48000000,'COD','Ghi Chú','đã hủy','2020-08-27 11:25:54','2020-08-27 04:25:54'),(130,141,1,'2020-08-27',26500000,'COD','Ghi Chú','Đang xử lý','2020-08-27 04:35:07','2020-08-27 04:35:07'),(131,142,1,'2020-08-27',12000000,'COD','Ghi Chú','Đang xử lý','2020-08-27 04:39:22','2020-08-27 04:39:22'),(132,143,1,'2020-08-27',14000000,'COD','Ghi Chú','Đang xử lý','2020-08-27 04:43:58','2020-08-27 04:43:58'),(133,144,1,'2020-08-27',11500000,'COD','Ghi Chú','Đang xử lý','2020-08-27 04:44:56','2020-08-27 04:44:56'),(134,145,1,'2020-08-27',11500000,'COD','Ghi Chú','Đang xử lý','2020-08-27 04:45:54','2020-08-27 04:45:54'),(135,146,1,'2020-08-27',11500000,'COD','Ghi Chú','Đang xử lý','2020-08-27 04:50:45','2020-08-27 04:50:45'),(136,147,1,'2020-08-27',11500000,'COD','Ghi Chú','Đang xử lý','2020-08-27 04:53:07','2020-08-27 04:53:07'),(137,148,1,'2020-08-27',11500000,'COD','Ghi Chú','Đang xử lý','2020-08-27 04:53:43','2020-08-27 04:53:43'),(138,149,3,'2020-08-27',19000000,'COD','Ghi Chú','Đang xử lý','2020-08-27 04:54:46','2020-08-27 04:54:46'),(139,150,2,'2020-08-27',17500000,'COD','Ghi Chú','Đang xử lý','2020-08-27 04:58:39','2020-08-27 04:58:39'),(140,151,2,'2020-08-27',17500000,'COD','Ghi Chú','Đang xử lý','2020-08-27 04:59:50','2020-08-27 04:59:50'),(141,152,2,'2020-08-27',17500000,'COD','Ghi Chú','Đang xử lý','2020-08-27 05:07:51','2020-08-27 05:07:51'),(142,153,2,'2020-08-27',17500000,'COD','Ghi Chú','Đang xử lý','2020-08-27 05:08:37','2020-08-27 05:08:37'),(143,154,2,'2020-08-27',17500000,'COD','Ghi Chú','Đang xử lý','2020-08-27 05:09:26','2020-08-27 05:09:26'),(144,155,2,'2020-08-27',17500000,'COD','Ghi Chú','Đang xử lý','2020-08-27 05:09:45','2020-08-27 05:09:45'),(145,156,2,'2020-08-27',17500000,'COD','Ghi Chú','đã hủy','2020-08-27 12:29:41','2020-08-27 05:29:41'),(146,157,2,'2020-08-27',17500000,'COD','Ghi Chú','đã hủy','2020-08-27 12:26:16','2020-08-27 05:26:16'),(147,158,2,'2020-08-27',36900000,'COD','Ghi Chú','đã hủy','2020-08-27 12:25:22','2020-08-27 05:25:22'),(148,159,2,'2020-08-27',4500000,'COD','Ghi Chú','đã hủy','2020-08-27 12:22:58','2020-08-27 05:22:58'),(149,160,2,'2020-08-27',14000000,'COD','Ghi Chú','đã hủy','2020-08-27 12:30:54','2020-08-27 05:30:54'),(150,161,2,'2020-08-27',14500000,'COD','Ghi Chú','đã hủy','2020-08-27 12:33:20','2020-08-27 05:33:20'),(151,162,2,'2020-08-27',7500000,'COD','Ghi Chú','đã hủy','2020-08-27 12:34:40','2020-08-27 05:34:40'),(152,163,5,'2020-08-27',35200000,'COD','Ghi Chú','đã xác nhận','2020-08-27 13:16:28','2020-08-27 06:16:28'),(153,164,5,'2020-08-27',21000000,'COD','Ghi Chú','đã hủy','2020-08-27 13:21:03','2020-08-27 06:21:03'),(154,165,5,'2020-08-27',21000000,'COD','Ghi Chú','Đang xử lý','2020-08-27 06:19:01','2020-08-27 06:19:01'),(155,166,5,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-27 06:21:42','2020-08-27 06:21:42'),(156,167,5,'2020-08-27',7000000,'COD','Ghi Chú','Đang xử lý','2020-08-27 06:22:00','2020-08-27 06:22:00');
/*!40000 ALTER TABLE `bills` ENABLE KEYS */;
UNLOCK TABLES;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
/*!50003 CREATE*/ /*!50017 DEFINER=`root`@`localhost`*/ /*!50003 TRIGGER `bills_BEFORE_UPDATE` BEFORE UPDATE ON `bills` FOR EACH ROW BEGIN

declare Name_people_action varchar(50);
declare Name_customer varchar(50);
declare action_string varchar(50);
declare Chuc_vu varchar(50);
declare Level1 int(11);
declare Old_order_acept int(10);
declare Old_doanh_so float ;
declare Old_order_done int(10);

set Name_people_action = (SELECT full_name FROM users WHERE id = new.id_last_user_action);
set Name_customer = (SELECT name FROM customer WHERE id = old.id_customer);
set Level1 = (SELECT level FROM users WHERE id = new.id_last_user_action);
set Old_order_acept = (SELECT order_acept FROM users WHERE id = new.id_last_user_action);
set Old_doanh_so = (SELECT doanh_so FROM users WHERE id = new.id_last_user_action);
set Old_order_done = (SELECT order_done FROM users WHERE id = new.id_last_user_action);


if ( Level1 = 1) then
	set Chuc_vu = 'admin';
else if (Level1 = 2) then
		set Chuc_vu = 'Nhân viên kinh doanh';
     else if (Level1 = 0) then
			set Chuc_vu = 'Khách hàng';
		  end if;
	end if;
end if;

if (new.status = 'đã xác nhận') then
	set action_string = 'Xác nhận đơn hàng của khách';
-- Them +1 vao order_acept 
	UPDATE `thoi_trang`.`users` 
    SET `order_acept` = (Old_order_acept + 1) 
    WHERE (`id` = new.id_last_user_action);

else if (new.status = 'đã xử lý') then
		set action_string = 'Xác nhận đã giao hàng';
-- Thêm doanh số và +1 vào số đơn hoàn thành của nhân viên khi hoàn thành đơn hàng
		UPDATE `thoi_trang`.`users` 
        SET `doanh_so` = (Old_doanh_so + old.total), `order_done` = (Old_order_done + 1) 
        WHERE (`id` = new.id_last_user_action);
        
	 else if (new.status = 'đã hủy') then
			set action_string = 'Hủy đơn hàng';
		  end if;
	 end if;
end if;

INSERT INTO `thoi_trang`.`history_order_action_bills` 
( `type_user`, `name_people_action`, `action`, `id_customer`, 
`id_bills`, `name_customer`, `total_1_bills`, `old_status`, 
`new_status`, `image`, `time_action`, `created_at`, `updated_at`) 
VALUES ( Chuc_vu , Name_people_action, action_string , old.id_customer,
old.id, Name_customer, old.total, old.status, 
 new.status, 'anh', current_timestamp(), current_timestamp(), current_timestamp());
 
END */;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-08-27 20:43:03
